# __author__ : "王丽"
#editor:冯雪静 2016.3.28
Feature: 会员管理-会员列表-会员详情-购买信息
	"""
		针对线上BUG3740补充feature

		当前会员的购买信息（包含订单状态如下的订单：待发货、已发货、已完成、退款中、退款完成）
		（1）【购买金额】：计算的是“已完成”的订单的总金额包括（微众卡金额+现金）

		（2）【购买次数】：计算的是“已完成”的订单

		（3）【平均客单价】：=【购买金额】/【购买次数】

		（4）当前会员的购买订单列表，（包含订单状态如下的订单：待发货、已发货、已完成、退款中、退款完成）
	"""

Background:
	Given jobs登录系统
	And jobs设定会员积分策略
		"""
		{
			"integral_each_yuan": 2,
			"use_ceiling": 50
		}
		"""
	#添加相关基础数据
		When jobs已添加商品
			"""
			[{
				"name": "商品1",
				"postage":10.00,
				"price":100.00,
				"stock_type": "无限"
			},{
				"name": "商品2",
				"postage":15.00,
				"price":100.00,
				"stock_type": "无限"
			}]
			"""
		And jobs已添加支付方式
			"""
			[{
				"type": "货到付款",
				"description": "我的货到付款",
				"is_active": "启用"
			},{
				"type": "微信支付",
				"description": "我的微信支付",
				"is_active": "启用",
				"weixin_appid": "12345",
				"weixin_partner_id": "22345",
				"weixin_partner_key": "32345",
				"weixin_sign": "42345"
			},{
				"type": "支付宝",
				"is_active": "启用"
			}]
			"""
		And jobs开通使用微众卡权限
		And jobs添加支付方式
			"""
			[{
				"type": "微众卡支付",
				"description": "我的微众卡支付",
				"is_active": "启用"
			}]
			"""
		given jobs已创建微众卡
		"""
		{
			"cards":[{
				"id":"0000001",
				"password":"1234567",
				"status":"未使用",
				"price":110.00
			},{
				"id":"0000002",
				"password":"1234567",
				"status":"未使用",
				"price":100.00
			},{
				"id":"0000003",
				"password":"1234567",
				"status":"未使用",
				"price":100.00
			}]
		}
		"""
	when jobs添加优惠券规则
		"""
		[{
			"name": "全体券1",
			"money": 10.00,
			"start_date": "2015-3-1",
			"end_date": "10天后",
			"coupon_id_prefix": "coupon1_id_"
		}]
		"""
		And bill关注jobs的公众号
		When bill访问jobs的webapp
		When bill获得jobs的100会员积分
		Then bill在jobs的webapp中拥有100会员积分
		When 微信用户批量消费jobs的商品
			|    order_id    |    date    |delivery_time| consumer |   product | payment | pay_type | postage*| price* | integral |     coupon          |  weizoom_card   | paid_amount*| alipay*| wechat*| cash*|   action      | order_status* |
			| 对应订单编号01 | 2015-01-01 |             | bill     | 商品1,1   | 支付    | 支付宝   | 10.00   | 100.00 |          |                     |                 | 110.00      | 110.00 | 0.00   | 0.00 |               | 待发货        |
			| 对应订单编号02 | 2015-01-02 |             | bill     | 商品2,2   |         | 支付宝   | 15.00   | 100.00 |          |                     |                 | 0.00        | 0.00   | 0.00   | 0.00 | jobs,取消     | 已取消        |
			| 对应订单编号03 | 2015-02-01 |  2015-02-02 | bill     | 商品2,2   | 支付    | 支付宝   | 15.00   | 100.00 |          |                     |                 | 215.00      | 215.00 | 0.00   | 0.00 | jobs,发货     | 已发货        |
			| 对应订单编号04 | 2015-02-02 |  2015-02-02 | bill     | 商品1,1   | 支付    | 微信支付 | 10.00   | 100.00 |          | 全体券1,coupon1_id_1 |                 | 100.00      | 0.00   | 100.00 | 0.00 | jobs,完成     | 已完成        |
			| 对应订单编号05 | 2015-02-04 |             | bill     | 商品1,1   |         | 微信支付 | 10.00   | 100.00 |          |                     |                 | 0.00        | 0.00   | 0.00   | 0.00 |               | 待支付        |
			| 对应订单编号06 | 2015-03-04 |  2015-03-04 | bill     | 商品2,1   | 支付    | 微信支付 | 15.00   | 100.00 |          |                     |                 | 115.00      | 0.00   | 115.00 | 0.00 | jobs,退款     | 退款中        |
			| 对应订单编号07 | 2015-03-05 |  2015-03-05 | bill     | 商品1,1   | 支付    | 支付宝   | 10.00   | 100.00 |          |                     |                 | 110.00      | 110.00 | 0.00   | 0.00 | jobs,完成退款 | 退款完成      |
			| 对应订单编号08 | 2015-03-05 |  2015-03-05 | bill     | 商品1,1   | 支付    | 支付宝   | 10.00   | 100.00 |          |                     | 0000001,1234567 | 110.00      | 0.00   | 0.00   | 0.00 | jobs,完成     | 已完成        |
			| 对应订单编号09 | 2015-03-05 |  2015-03-05 | bill     | 商品1,1   | 支付    | 微信支付 | 10.00   | 100.00 |  100     |                     |                 | 60.00       | 0.00   | 60.00  | 0.00 | jobs,完成     | 已完成        |
			| 对应订单编号10 | 2015-03-05 |  2015-03-05 | bill     | 商品1,1   | 支付    | 微信支付 | 10.00   | 100.00 |          |                     | 0000003,1234567 | 110.00      | 0.00   | 10.00  | 0.00 | jobs,完成退款 | 退款完成      |

@mall2 @member @memberList @order
Scenario:1 当前会员的"会员详情"的"购买信息"数据

	#购买金额、购买次数，计算的全部是“已完成”的订单总和
	#购买金额包括（微众卡金额+现金）
	#微众卡金额
	Given jobs登录系统
	When jobs访问'bill'会员详情
	Then jobs获得'bill'的购买信息
		"""
		{
			"purchase_amount":270.00,
			"purchase_number":3,
			"customer_price":90.00,
			"money_wcard":110.00
		}
		"""
	Then jobs获得'bill'的订单列表
		|   order_id    | order_amount |    date    | order_status |
		|对应订单编号10 |    110.00    | 2015-03-05 | 退款成功     |
		|对应订单编号09 |    60.00     | 2015-03-05 | 已完成       |
		|对应订单编号08 |    110.00    | 2015-03-05 | 已完成       |
		|对应订单编号07 |    110.00    | 2015-03-05 | 退款成功     |
		|对应订单编号06 |    115.00    | 2015-03-04 | 退款中       |
		|对应订单编号05 |    110.00    | 2015-02-04 | 待支付       |
		|对应订单编号04 |    100.00    | 2015-02-02 | 已完成       |
		|对应订单编号03 |    215.00    | 2015-02-01 | 已发货       |
		|对应订单编号02 |    215.00    | 2015-01-02 | 已取消       |
		|对应订单编号01 |    110.00    | 2015-01-01 | 待发货       |
