#_author_:王丽

Feature: 会员分析-会员概况-会员增长趋势
"""
	对店铺的会员进行不同维度的分析

	说明：整个会员的统计只统计真实会员，没有注册直接下单的不统计

	一、查询条件

		1、刷选日期
			1）开始日期和结束日期都为空；选择开始结束日期，精确到日期
			2）开始日期或者结束日期，只有一个为空，给出系统提示“请填写XX日期”
			3）默认为‘今天’，筛选日期：‘今天’到‘今天’
			4）包含筛选日期的开始和结束的边界值
			5）手工设置筛选日期，点击查询后，‘快速查询’的所有项都处于‘未选中状态’

		2、快速查看
		    1）今天：查询的当前日期，例如，今天是2015-6-16，筛选日期是：2015-6-16到2015-6-16
		    2）昨天：查询的前一天，例如，今天是2015-6-16，筛选日期是：2015-6-15到2015-6-15
			3）最近7天；包含今天，向前7天；例如，今天是2015-6-16，筛选日期是：2015-6-10到2015-6-16
			4）最近30天；包含今天，向前30天；例如，今天是2015-6-16，筛选日期是：2015-05-019到2015-6-16
			5）最近90天；包含今天，向前90天；例如，今天是2015-6-16，筛选日期：2015-3-19到2015-6-16
			6）全部：筛选日期更新到：2013.1.1到今天

	二、会员增长趋势
		会员增长每天的趋势折线图  横轴坐标是按天的日期
		鼠标滑过曲线的上的日期时间点，显示：【日期、总会员、新增会员、手机绑定会员、下单会员】

		1、【新增会员】：在查询区间的不同日期点的新增会员数量的分布曲线

			备注：包含‘关注’和‘已取消’状态的会员

			例如：筛选日期：2015-05-01到2015-05-022
					2015-05-010的【新增会员】=∑会员.个数[(2015-05-010 00:00 <= 会员.加入时间 < 2015-05-011 00:00)]
					其他日期点的【新增会员】依次类推

		2、【手机绑定会员】：在查询区间的不同日期点的新增手机绑定会员数量的分布曲线

			即：‘会员手机绑定时间’在查询区间内的手机绑定会员数在不同时间点的分布曲线

			例如：筛选日期：2015-05-01到2015-05-022
					2015-05-010的【手机绑定会员】=∑会员.个数[(2015-05-010 00:00 <= 会员.手机绑定时间 < 2015-05-011 00:00)]
					其他日期点的【手机绑定会员】依次类推

		3、【下单会员】：在查询区间的不同日期点的下单会员的数量分布曲线

			即：‘下单时间’在查询区间内的订单的买家在不同时间点的分布曲线

			例如：筛选日期：2015-05-01到2015-05-022
					2015-05-010的【下单会员】=∑订单.买家个数[(2015-05-010 00:00 <= 订单.下单时间 < 2015-05-011 00:00)
															and (订单.来源 ='本店') and (订单.订单状态 in {待发货、已发货、已完成})]
					其他日期点的【下单会员】依次类推				
"""

Background:
	Given jobs登录系统

	When jobs已添加商品
		"""
		[{
			"name": "商品1",
			"price": 100.00,
			"weight": 5,
			"postage": 10.00,
			"stock_type": "无限"
		},{
			"name": "商品2",
			"price": 100.00,
			"weight": 5,
			"postage": 15.00,
			"stock_type": "无限"
		}]
		"""
	And jobs已添加支付方式
		"""
		[{
			"type": "货到付款",
			"is_active": "启用"
		}, {
			"type": "微信支付",
			"is_active": "启用"
		}, {
			"type": "支付宝",
			"is_active": "启用"
		}]
		"""

	When bill1关注jobs的公众号于'2015-04-21'
	When bill2关注jobs的公众号于'2015-05-01'
	When bill3关注jobs的公众号于'2015-05-01'
	When bill4关注jobs的公众号于'2015-05-02'
	When bill5关注jobs的公众号于'2015-05-02'
	When bill6关注jobs的公众号于'2015-05-03'
	When bill7关注jobs的公众号于'2015-05-03'
	When bill8关注jobs的公众号于'2015-05-03'
	When bill9关注jobs的公众号于'2015-05-03'
	When bill10关注jobs的公众号于'2015-05-04'
	When bill11关注jobs的公众号于'2015-05-06'
	When bill12关注jobs的公众号于'2015-05-06'
	When bill13关注jobs的公众号于'2015-05-07'
	When bill14关注jobs的公众号于'2015-05-07'
	When bill15关注jobs的公众号于'2015-05-08'
	When bill16关注jobs的公众号于'2015-05-09'
	When bill17关注jobs的公众号于'2015-05-09'
	When bill18关注jobs的公众号于'2015-05-10'
	When bill19关注jobs的公众号于'2015-06-01'

	When bill5取消关注jobs的公众号
	When bill11取消关注jobs的公众号

	When 微信用户批量消费jobs的商品
		| order_id | date       | consumer  | product  | payment | pay_type | postage*   | price*      | paid_amount*   | alipay*   | wechat*   | cash*|   action      |  order_status*  |
		|  0001    | 2015-05-01 | bill2     | 商品1,1  | 支付    | 微信支付 | 10.00      | 100.00      | 110.00         | 0.00      |   110.00  | 0.00    | jobs,完成     |    已完成       |
		|  0002    | 2015-05-03 | bill1     | 商品1,1  |         | 支付宝   | 10.00      | 100.00      | 110.00         | 0.00      |    0.00   | 0.00    |               |    待支付       |
		|  0003    | 2015-05-03 | bill4     | 商品2,1  |         | 微信支付 | 15.00      | 100.00      | 115.00         | 0.00      |    0.00   | 0.00    | jobs,取消     |    已取消       |
		|  0004    | 2015-05-04 | bill1     | 商品1,1  | 支付    | 货到付款 | 10.00      | 100.00      | 110.00         | 0.00      |    0.00   | 0.00    | jobs,取消     |    已取消       |
		|  0005    | 2015-05-05 | bill5     | 商品1,1  | 支付    | 货到付款 | 10.00      | 100.00      | 110.00         | 0.00      |    0.00   | 110.00  | jobs,发货     |    已发货       |
		|  0006    | 2015-05-05 | bill5     | 商品2,1  | 支付    | 货到付款 | 15.00      | 100.00      | 115.00         | 0.00      |    0.00   | 115.00  |               |    待发货       |
		|  0007    | 2015-05-06 | bill6     | 商品1,1  | 支付    | 支付宝   | 10.00      | 100.00      | 110.00         | 110.00    |    0.00   | 0.00    | jobs,完成     |    已完成       |
		|  0008    | 2015-05-06 | bill3     | 商品1,1  | 支付    | 支付宝   | 10.00      | 100.00      | 110.00         | 0.00      |    0.00   | 0.00    | jobs,退款     |    退款中       |
		|  0009    | 2015-05-06 | bill4     | 商品1,1  | 支付    | 支付宝   | 10.00      | 100.00      | 110.00         | 0.00      |    0.00   | 0.00    | jobs,完成退款 |    退款完成     |
		|  0010    | 2015-05-07 | -lili     | 商品2,1  | 支付    | 微信支付 | 15.00      | 100.00      | 115.00         | 0.00      |   115.00  | 0.00    | jobs,发货     |    已发货       |
		|  0011    | 2015-06-01 | bill8     | 商品2,2  | 支付    | 支付宝   | 15.00      | 100.00      | 215.00         | 215.00    |    0.00   | 0.00    | jobs,发货     |    已发货       |

@mall2 @bi @memberAnalysis   @stats @stats.member
Scenario: 1  会员概况：会员增长趋势
	Given jobs登录系统
	When jobs设置筛选日期
		"""
		{
			"start_date":"2015-05-01",
			"end_date":"2015-05-10"
		}
		"""
	Then jobs获得会员增长趋势数据
		|   date     | new_member_count |  bought_member_count |
		| 2015-05-01 |         2        |           1          |
		| 2015-05-02 |         2        |           0          |
		| 2015-05-03 |         4        |           0          |
		| 2015-05-04 |         1        |           0          |
		| 2015-05-05 |         0        |           1          |
		| 2015-05-06 |         2        |           1          |
		| 2015-05-07 |         2        |           1          |
		| 2015-05-08 |         1        |           0          |
		| 2015-05-09 |         2        |           0          |
		| 2015-05-10 |         1        |           0          |
