#_author_:张三香
#editor:王丽  2015.10.19

Feature:商品概况-概况数据
"""
	#对店铺的商品进行不同维度的分析

	一、查询条件
		1、刷选日期
			1）开始日期和结束日期都为空；选择开始结束日期，精确到日期
			2）开始日期或者结束日期，只有一个为空，给出系统提示“请填写XX日期”
			3）默认为‘今天’，筛选日期：‘今天’到‘今天’
			   需求变更，默认为"最近7天"，筛选日期：‘7天前’到‘今天’
			4）包含筛选日期的开始和结束的边界值
			5）手工设置筛选日期，点击查询后，‘快速查询’的所有项都处于‘未选中状态’
		2、快速查看
		    1）今天：查询的当前日期，例如，今天是2015-6-16，筛选日期是：2015-6-16到2015-6-16
		    2）昨天：查询的前一天，例如，今天是2015-6-16，筛选日期是：2015-6-15到2015-6-15
			3）最近7天；包含今天，向前7天；例如，今天是2015-6-16，筛选日期是：2015-6-10到2015-6-16
			4）最近30天；包含今天，向前30天；例如，今天是2015-6-16，筛选日期是：2015-5-19到2015-6-16
			5）最近90天；包含今天，向前90天；例如，今天是2015-6-16，筛选日期：2015-3-19到2015-6-16
			6）全部：筛选日期更新到：2013.1.1到今天

	二、商品概况
	    1、【购买总人数】=查询区间内，所有购买过商品的人数

	    '？'说明窗提示:购买商品的总人数

	      备注：购买总人数包括会员（关注和取消关注）和非会员，非会员购买时，uesr_id不同才累加
	            现在系统：非会员的身份就等同于取消关注状态的会员
	            1）会员购买商品1
                2）已跑路会员购买商品1
                3）非会员购买商品1：
                   非会员a从链接1购买商品1
                   非会员a从链接1购买商品1
                   非会员a从链接2购买商品1
                   非会员b从链接2购买商品1
	            只计算有效订单，即订单状态为待发货、已发货、已完成的订单

		2、【下单单量】=∑订单.个数[(订单状态 in {待发货、已发货、已完成}) and (订单.下单时间 in 查询区间) and (订单.来源='本店')]

		   
		   '？'说明窗提示:当前所选时段内该店铺已发货、待发货、已完成的订单数之和

		3、【总成交件数】=∑订单.商品件数[(订单状态 in {待发货、已发货、已完成}) and (订单.下单时间 in 查询区间)
										and (订单.来源='本店')]
	        
	        '？'说明窗提示:当前所选时段内所有成交订单内商品总件数
"""

Background:
    Given jobs登录系统
    And jobs设定会员积分策略
        """
        {
            "be_member_increase_count":500,
            "integral_each_yuan":10
        }
        """

    When jobs添加支付方式
        """
        [{
            "type": "货到付款",
            "description": "我的货到付款",
            "is_active": "启用"
        },{
            "type": "微信支付",
            "description": "我的微信支付",
            "is_active": "启用",
            "weixin_appid": "12345", 
            "weixin_partner_id": "22345", 
            "weixin_partner_key": "32345", 
            "weixin_sign": "42345"
        },{
            "type": "支付宝",
            "description": "我的支付宝支付",
            "is_active": "启用"
        }]
        """
    And jobs开通使用微众卡权限
    And jobs添加支付方式
        """
        [{
            "type": "微众卡支付",
            "description": "我的微众卡支付",
            "is_active": "启用"
        }]
        """
    Given jobs已创建微众卡
        """
        {
            "cards":[{
                "id":"0000002",
                "password":"1234567",
                "status":"未使用",
                "price":90.00
            }]
        }
        """
    
    When jobs添加商品规格
        """
        [{
            "name": "颜色",
            "type": "文字",
            "values": [{
                "name": "黑色"
            },{
                "name": "白色"
            }]
        }]
        """
    And jobs已添加商品
        """
        [{
            "name": "商品1",
            "postage": 10.00,
            "price": 100.00,
            "weight": 5.0,
            "stock_type": "无限",
            "synchronized_mall":"是"
        }, {
            "name": "商品2",
            "postage": 15.00,
            "is_enable_model": "启用规格",
            "model": {
                "models": {
                    "黑色": {
                        "price": 100.00,
                        "weight": 5.0,
                        "stock_type": "无限"
                    },
                    "白色": {
                        "price": 100.00,
                        "weight": 5.0,
                        "stock_type": "无限"
                    }
                }
            },
            "synchronized_mall":"是"
        }]
        """

    And jobs创建积分应用活动
        """
        [{
            "name": "商品1积分应用",
            "start_date": "2014-08-01",
            "end_date": "10天后",
            "product_name": "商品1",
            "is_permanant_active": "true",
            "rules": [{
                "member_grade": "全部会员",
                "discount": 20,
                "discount_money": 20.00
            }]
        }, {
            "name": "商品2积分应用",
            "start_date": "2014-08-01",
            "end_date": "10天后",
            "product_name": "商品2",
            "is_permanant_active": "true",
            "rules": [{
                "member_grade": "全部会员",
                "discount": 20,
                "discount_money": 20.00
            }]
        }]
        """

    And jobs添加优惠券规则
        """
        [{
            "name": "全体券1",
            "money": 10.00,
            "start_date": "2014-08-01",
            "end_date": "10天后",
            "coupon_id_prefix": "coupon1_id_"
        }]
        """

    When jack关注jobs的公众号于'2014-07-01'
    When tom关注jobs的公众号于'2014-07-02'
    When marry关注jobs的公众号于'2014-07-03'

    When 微信用户批量消费jobs的商品
        | order_id |    date    | consumer |    product   | payment | pay_type |postage*   |price*   | product_integral    |       coupon         | paid_amount*    |  weizoom_card     | alipay*    | wechat*    | cash*    |   action      | order_status* |
        |   0001   | 2014-08-05 |   jack   | 商品1,1      |         | 支付宝   |   10.00   | 100.00  |       200.00        |                      |     90.00       |                   |   90.00    |    0.00    |   0.00   |               |    待支付     |
        |   0002   | 5天前      |   tom    | 商品1,1      |         | 支付宝   |   10.00   | 100.00  |       200.00        |                      |     90.00       |                   |   90.00    |    0.00    |   0.00   |  jobs,取消    |    已取消     |
        |   0003   | 4天前      |   tom    | 商品2,黑色,2 |   支付  | 微信支付 |   15.00   | 100.00  |        0.00         | 全体券1,coupon1_id_1 |     205.00      |                   |    0.00    |   205.00   |   0.00   |  jobs,发货    |    已发货     |
        |   0004   | 3天前      |   tom    | 商品2,白色,1 |   支付  | 货到付款 |   15.00   | 100.00  |        0.00         | 全体券1,coupon1_id_2 |     105.00      |  0000002,1234567  |    0.00    |    0.00    |   15.00  |  jobs,完成    |    已完成     |
        |   0005   | 2天前      |  marry   | 商品1,1      |   支付  | 支付宝   |   10.00   | 100.00  |       200.00        |                      |     90.00       |                   |   90.00    |    0.00    |   0.00   |  jobs,退款    |    退款中     |
        |   0006   | 今天       |  marry   | 商品1,1      |   支付  | 支付宝   |   10.00   | 100.00  |       200.00        |                      |     90.00       |                   |   90.00    |    0.00    |   0.00   |  jobs,完成退款|   退款成功    |
        #|   0007   | 今天       |   -tom3  | 商品1,1      |   支付  | 货到付款 |   10.00   | 100.00  |        0.00         |                      |     110.00      |                   |    0.00    |    0.00    |   110.00 |               |    待发货     |
        #|   0008   | 今天       |   -tom4  | 商品1,1      |   支付  | 支付宝   |   10.00   | 100.00  |        0.00         |                      |     110.00      |                   |   110.00   |    0.00    |   0.00   |               |    待发货     |
       
@mall2 @bi @salesAnalysis   @stats @stats.product
Scenario: 1 商品概况数据

	#商品概况数据
	Given jobs登录系统
	When  jobs设置筛选日期
		"""
		{
			"start_date":"5天前",
			"end_date":"今天"
		}
		"""
	Then jobs获得商品概况数据
		|    item           | quantity |
		|   购买总人数      |    1     |
		|   下单单量        |    2     |
		|   总成交件数      |    3     |
