# __author__ : "师帅"
Feature: 带参数二维码
"""
	# __author__ : "王丽"

	一、模块业务功能概述
		生成特定的二维码，对店铺进行推广，微信用户扫码，关注店铺公众账号，可以记录每个二维码带来的新增会员和这些会员的购买情况
		可以将二维码关联到某个会员（代言人），可以统计到代言人带来的会员情况和带来的会员的购买情况

	二、创建带参数二维码
		1、【二维码名称】：二维码的名称，只在二维码列表中显示
		2、【扫码奖励】：下拉选择(无奖励、积分、优惠券)，默认无奖励
			（1）选择"积分"：出现填写积分的文本框，填写积分；填写非零正整数
			（2）选择"优惠券"：出现"添加"按钮，点击弹出优惠券的列表(按照优惠券的创建顺序倒序排列)，选择优惠券，单选
			特别说明：此处设置的奖励，是给扫码后成为会员的或者已经是会员的扫码会员的奖励
		3、【成为指定等级会员】：下拉选择（会员等级列表，按照创建顺序倒序排列）
			特别说明：扫码后的会员（新关注或者已经关注）会员等级调整为设置等级
		4、【已关注会员可参与】："是"或者"否"
			(1)选择"是":已经关注过的会员（包含现在处于关注和取消关注的）可以参与此扫码
			(2)选择"否"：已经关注过的会员（包含现在处于关注和取消关注的）不可以参与此扫码
		5、【备注】：填写备注信息
			在二维码列表可以显示
		6、【关联会员】："是"或者"否"
			(1)选择"否":不关联会员
			(2)选择"是":出现"选择会员"，点击弹出"选择会员窗体"
				1)【设置会员头衔】：在会员的手机端"代言人二维码"页面显示，限制在5个字以内
				2)【二维码描述】：对二维码的描述，在会员的手机端"代言人二维码"页面的"活动说明"下显示
		7、【扫码后回复】：可以是文本和图文
				扫描二维码后回复
				(1)设置了"关注后自动回复"，同时设置了"扫码后回复"，非会员首次关注，扫码关注后，自动回复的是"扫码后回复"，
					没有关注后自动回复
				(2)已关注会员（包含现在处于关注和取消关注的），扫码后回复"扫码后回复"
		8、上述设置项都可以修改，修改之后按照新的设置项进行；"关联会员"只能修改"是"或者"否"，不能修改关联的会员

	三、带参数二维码列表
		1、按照"带参数二维码"的创建顺序倒序排列,
		2、【二维码名称】：创建二维码时的二维码名称
		3、【关注数量】：扫码的会员数
			(1)【已关注会员可参与】设置"是"：关注数量=扫码的新增会员数+已关注（包含现在处于关注和取消关注的）扫码会员数
			(2)【已关注会员可参与】设置"否"：关注数量=扫码的新增会员数
			(3)【关注数量】为零，数字为黑色，鼠标移动上时为竖线
				【关注数量】不为零，数字为蓝色，鼠标移动上时为小手，数字下出现横线
			(4)点击【关注数量】不为零的数字，跳转到"关注会员"页，显示此二维码带来的会员列表，按照关注时间倒序排列
				筛选条件
				1）【关注时间】：默认为空，按照关注时间进行过滤
				2）【仅显示通过二维码新关注的会员】：默认勾选；即通过扫此二维码新关注的会员
					取消勾选，显示通过扫此二维码新关注的会员+之前的会员（包含现在处于关注和取消关注的）扫此二维码的会员
				3）字段
					【会员】：会员头像和昵称；点击头像或者昵称，打开新页跳转到该会员的"会员详情"
					【购买次数】：此会员支付完的订单个数总和（待发货、已发货、已完成、退款中、退款完成）
							=∑订单.个数[(订单.买家=当前会员) and (订单.状态 in {待发货、已发货、已完成、退款中、退款成功})]
					【积分】：会员当前的积分
					【消费总额】：此会员支付完的订单实付金额总和（待发货、已发货、已完成、退款中、退款完成）
							=∑订单.实付金额[(订单.买家=当前会员) and (订单.状态 in {待发货、已发货、已完成、退款中、退款成功})]
					【会员等级】：会员的等级
					【关注时间】：会员首次成为会员的时间
				4）可以按照【购买次数】、【积分】、【消费总额】、【关注时间】排序
		4、【扫码后成交金额】：=∑订单.实付金额[(订单.买家 已扫码) and (订单.下单时间 >=会员.扫码时间) and (订单.状态 in {待发货、已发货、已完成})]
					扫过此二维码，并且订单的下单时间在扫此二维码的时间之后的有效订单（订单状态：待发货、已发货、已完成）的实付金额的总和
			(1)【扫码后成交金额】为零，数字为黑色，鼠标移动上时为竖线
				【扫码后成交金额】不为零，数字为蓝色，鼠标移动上时为小手，数字下出现横线
			(2)点击【扫码后成交金额】不为零的数字，跳转到"交易订单"页，显示扫此二维码的会员的有效订单（订单状态为：待发货、已发货、已完成）列表，
				按照下单时间倒序排列
				筛选条件
				1)【下单时间】：默认为空，攒好下单时间进行过滤
				2)【仅显示扫码后成交订单】：默认勾选，即扫过此二维码，且此会员的"下单时间"在"扫码时间"之后的订单
					取消勾选：显示扫过此二维码，会员的所有订单
				3)字段
					【商品】、【单价/数量】、【优惠金额】、【买家】、【实付金额】、【订单状态】同订单列表中的信息
		5、【扫码奖励】：当前次二维码设置的扫码奖励
		6、【创建时间】：创建此二维码的时间
		7、【备注】：创建二维码时填写的备注信息
		8、【关联会员】：此二维码关联会员的昵称
		9、【操作】："查看二维码"，点击打开新页，二维码图片

	四、代言人手机端功能
		1、只能在【公众账号设置】-【自定义菜单】中配置功能链接"代言人二维码"
		2、非代言人会员，点击此菜单进入"代言人二维码"页，给出提示页"您现在还不是代言人，如果您想成为代言人，可通过公众号联系我们"
			代言人会员，点击此菜单进入"代言人二维码"页，显示本会员的"昵称"、"头像"、"头衔"、"带公众号图标的二维码"、"已推荐的扫码人数"
				、"活动说明"
			特别说明：此页面可以分享，分享的链接被点击之后，分享者会获得【微商城管理】-【首页】-【积分规则】中设置的分享链接奖励的相应积分
		3、【已推荐的扫码人数】为零，文字为黑色，鼠标移动上时为竖线
			【已推荐的扫码人数】不为零，文字为蓝色，鼠标移动上时为小手，文字下出现横线
			(1)点击【已推荐的扫码人数】，跳转到"推荐详情"页
				1）【扫码人数】：同二维码列表中的【关注数量】
				2）【下单人数】：扫码后成交订单的买家数，去掉重复的会员
				3）【成交金额】：同二维码列表中的【扫码后成交金额】
				4）推荐会员，即扫码会员的头像、昵称列表
			特别说明：此页面不能分享
	五、应用场景规则
		1、会员扫码，会员的相关数据会跟着扫码变化，数据始终在最后一次扫码的二维码中
		例：存在"带参数二维码"：二维码一（创建时间：2015-5-8），二维码二（创建时间：2015-6-8）
			（1）会员1，存在订单：订单1（下单时间：2015-4-8，实付金额：50）
			（2）会员1，扫码"二维码一"，之后下订单：订单2（2015-5-10，实付金额：100）
				查看"二维码一",关联会员数（1），扫码后成交金额（100），交易订单：订单1（下单时间：2015-4-8，实付金额：50）；订单2（2015-5-10，实付金额：100）
			（3）会员1，扫码"二维码二"，之后下订单：订单3（2015-6-10，实付金额：200）
				查看"二维码一",关联会员数（0），扫码后成交金额（0），交易订单：空
				查看"二维码一",关联会员数（1），扫码后成交金额（200），
				     交易订单：订单1（下单时间：2015-4-8，实付金额：50）；订单2（2015-5-10，实付金额：100）；订单3（2015-6-10，实付金额：200）

		针对线上BUG3990
		2、会员重复扫码不会重复获得奖励，每个会员只能获得此二维码对应的一份奖励
		例：存在"带参数二维码"：二维码一（创建时间：2015-5-8：奖励：积分20），二维码二（创建时间：2015-6-8 奖励：积分30）
			（1）会员1，扫"二维码一"获得积分奖励20
			（2）会员1，再扫"二维码二"获得积分奖励30
			（3）会员1，再次扫"二维码二"没有获得任何奖励
			（3）会员1，再次扫"二维码一"没有获得任何奖励

		针对线上BUG3884
		3、代言人（二维码关联会员）扫自己的二维码，不会成为自己的粉丝，此二维码的【关注数量】不增加
		例：存在"带参数二维码"：二维码一（创建时间：2015-5-8：奖励：积分20 关联会员：会员1）
			会员1扫码"二维码一",会员1没有获得相应的积分奖励，"二维码一"的【关注数量】不增加

"""

Background:
	Given jobs添加商品
	"""
		[{
			"name": "商品1",
			"price": 100
		}, {
			"name": "商品2",
			"price": 200
		}, {
			"name": "商品3",
			"price": 300
		}]
	"""

Scenario: 1新建二维码
	When jobs登录系统
	And jobs新建二维码
	"""
		[{
			"name": "二维码1",
			"scan_reward": "积分100",
			"become_designated_member": "普通会员",
			"attention_member_participation": "True",
			"associate_member": "False",
			"scan_code": "1111"
		}, {
			"name": "二维码2",
			"scan_reward": "优惠券",
			"become_designated_member": "普通会员",
			"attention_member_participation": "True",
			"associate_member": "False",
			"scan_code": "1111"
		}, {
			"name": "二维码3",
			"scan_reward": "优惠券",
			"become_designated_member": "银牌会员",
			"attention_member_participation": "False",
			"associate_member": "True",
			"member": "ss"
			"scan_code": "1111"
		}]
	"""

	Then jobs能获取二维码列表
	"""
		[{
			"name": "二维码1",
			"attention_number": 0,
			"attention_money": 100
			"create_time": 2015-08-17,
			"scan_reward": "积分100"
		}, {
			"name": "二维码2",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-13,
			"scan_reward": "优惠券"
		}, {
			"name": "二维码3",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-12,
			"scan_reward": "优惠券"
		}]
	"""

Scenario: 2搜索，查看，排序操作
	Given jobs新建二维码
	"""
		[{
			"name": "二维码1",
			"scan_reward": "积分100",
			"become_designated_member": "普通会员",
			"attention_member_participation": "True",
			"associate_member": "False",
			"scan_code": "1111"
		}, {
			"name": "二维码2",
			"scan_reward": "优惠券",
			"become_designated_member": "普通会员",
			"attention_member_participation": "True",
			"associate_member": "False",
			"scan_code": "1111"
		}, {
			"name": "二维码3",
			"scan_reward": "优惠券",
			"become_designated_member": "银牌会员",
			"attention_member_participation": "False",
			"associate_member": "False",
			"scan_code": "1111"
		}]
	"""

	Then jobs能获取二维码列表
	"""
		[{
			"name": "二维码1",
			"attention_number": 0,
			"attention_money": 100
			"create_time": 2015-08-17,
			"scan_reward": "积分100"
		}, {
			"name": "二维码2",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-13,
			"scan_reward": "优惠券"
		}, {
			"name": "二维码3",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-12,
			"scan_reward": "优惠券"
		}]
	"""
	When jobs点击'二维码1'
	Then jobs进入二维码编辑页面
	When jobs设置筛选条件
	"""
		{
			"name": "1"
		}
	"""
	Then jobs能获取二维码列表
	"""
		{
			"name": "二维码1",
			"attention_number": 0,
			"attention_money": 100
			"create_time": 2015-08-17,
			"scan_reward": "积分100"
		}
	"""
	When jobs查看二维码
	Then jobs显示二维码页面
	When jobs对时间排序
	Then jobs能获取二维码列表
	"""
		[{
			"name": "二维码3",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-12,
			"scan_reward": "优惠券"
		}, {
			"name": "二维码2",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-13,
			"scan_reward": "优惠券"
		}, {
			"name": "二维码1",
			"attention_number": 0,
			"attention_money": 100
			"create_time": 2015-08-17,
			"scan_reward": "积分100"
		}]
	"""
	When jobs对'关注数量'操作
	Then jobs显示'仅显示通过二维码新关注会员'
	When jobs对'扫码后成交金额'操作
	Then jobs显示'仅显示扫码后成交订单'

Scenario: 3操作'关注数量'和'扫码后成交金额'
	When jobs登录系统
	And tom1关注jobs的公众号
	And tom1购买jobs的商品
	"""
		{
			"products": [{
				"name": "商品1",
				"price": 100.00,
				"count": 1
			}]
		}
	"""
	And tom2关注jobs的公共号
	And tom2购买jobs的商品
	"""
		{
			"products": [{
				"name" "商品2",
				"price": 200.00,
				"count": 1
			}]
		}
	"""
	And jobs新建二维码
	"""
		[{
			"name": "二维码1",
			"scan_reward": "积分100",
			"become_designated_member": "普通会员",
			"attention_member_participation": "True",
			"associate_member": "False",
			"scan_code": "1111"
		}, {
			"name": "二维码2",
			"scan_reward": "优惠券",
			"become_designated_member": "普通会员",
			"attention_member_participation": "True",
			"associate_member": "False",
			"scan_code": "1111"
		}]
	"""

	Then jobs能获取二维码列表
	"""
		[{
			"name": "二维码1",
			"attention_number": 0,
			"attention_money": 100
			"create_time": 2015-08-17,
			"scan_reward": "积分100"
		}, {
			"name": "二维码2",
			"attention_number": 0,
			"attention_money": 100,
			"create_time": 2015-18-13,
			"scan_reward": "优惠券"
		}]
	"""
	When tom1扫码'二维码1'
	And tom1购买jobs的商品
	"""
		{
			"products": [{
				"name": "商品2",
				"price" 200.00,
				"count": 1
			}]
		}
	"""

	And tom2扫码'二维码1'
	And tom2购买jobs的商品
	"""
		{
			"products": [{
				"name": "商品3",
				"price": 300.00,
				"count": 1
			}]
		}
	"""

	And tom3扫码'二维码1'
	Then jobs能获取二维码列表
	"""
		[{
			"name": "二维码1",
			"attention_number": 3,
			"attention_money": 500
		}, {
			"name": "二维码2",
			"attention_number": 0,
			"attention_money": 0
		}]
	"""

	When jobs对'二维码1'的'关注数量'操作
	Then jobs能获取'仅显示通过二维码新关注会员'列表
	"""
		[{
			"fans_name": "tom3",
			"buy_number": 0,
			"integral": 100
		}]
	"""
	When jobs取消勾选'仅显示通过二维码新关注会员'
	Then jobs能获取列表
	"""
		[{
			"fans_name": "tom3",
			"buy_number": 0,
			"integral": 100
		}, {
			"fans_name": "tom2",
			"buy_number": 500,
			"integral": 100
		}, {
			"fans_name": "tom1",
			"buy_number": 300,
			"integral": 100
		}]
	"""

	When jobs对'二维码1'的'扫码后成交金额'操作
	Then jobs能获取'仅显示扫码后成交订单'列表
	"""
		[{
			"status": "已发货",
			"final_price": 300.00,
			"products": [{
				"name": "商品3",
				"price": 300.00,
				"count": 1
			}]
		}, {
			"status": "已完成",
			"final_price": 200.00,
			"products": [{
				"name": "商品2",
				"price": 200.00,
				"count": 1
			}]
		}]
	"""
	When jobs取消勾选'仅显示扫码后成交订单'
	Then jobs能获取列表
	"""
		[{
			"status": "已发货",
			"final_price": 300.00,
			"products": [{
				"name": "商品3",
				"price": 300.00,
				"count": 1
			}]
		}, {
			"status": "已发货",
			"final_price": 200.00,
			"products": [{
				"name": "商品2",
				"price": 200.00,
				"count": 1
			}]
		}, {
			"status": "已发货",
			"final_price": 200.00,
			"products": [{
				"name": "商品2",
				"price": 200.00,
				"count": 1
			}]
		}, {
			"status": "已发货",
			"final_price": 100.00,
			"products": [{
				"name": "商品1",
				"price": 100.00,
				"count": 1
			}]
		}]
	"""
