# __author__ : "王丽"

Feature: 自营平台订单管理
"""
	自营平台单或者多供货商品商品的订单，支付之前不拆单，支付之后拆单

	1 所有订单都按照母子订单的方式展示
		1）待支付的订单，【订单状态】显示在合并的订单状态对应的处'待支付'
		2）支付之后的订单，【订单状态】和【操作按钮】拆分到各个子订单
		3）子订单状态和对应的按钮
			子订单状态         操作按钮
			待支付             支付、取消订单
			已取消             无
			待发货             发货、申请退款
			已发货             标记完成、修改物流、申请退款
			已完成             申请退款
			退款中             无
			退款完成           无
		4）母订单的状态根据子订单的状态按照如下规则定义
			按照订单状态优先级排序规则，取优先级最低的子订单状态显示
			订单状态优先级由低到高排序为：
			待支付->待发货->已发货->退款中->已完成->退款完成->已取消
	2 对子订单进行退款
		1）某个子订单点击【申请退款】，弹出退款录入的界面
			（1）展示出当前订单应退金额：
				即：“退款录入，当前订单应退￥50.00”（即子订单的商品总金额+运费）
				    “母订单支付金额：现金￥30.00+微众卡￥20.00+优惠券￥15.00+积分￥10.00=￥75.00”（各种支付方式对应金额）
			（2）运营人员需要输入当前订单退款的各个方式对应的金额
				"现金"：输入的金额必须为大于零的整数或者小数（保留两位小数）；不能大于母订单的现金支付的金额减去子订单已退款完成的,否则给出红色提示'最多可退XX.XX元'
				"微众卡"：输入的金额必须为大于零的整数或者小数（保留两位小数）；不能大于当前母订单的微众卡支付的金额,否则给出红色提示'最多可退XX.XX元'
				"优惠券"：输入的金额必须为大于零的整数或者小数（保留两位小数）；
				"积分"：积分比例按照系统当前的抵扣比例展示，输入积分值，只能是零或正整数，自动按照现在的积分比例计算出抵扣金额
			（3）当母订单中已经有订单的退款录入时，再对其他子订单操作退款时，展示添加【已退款金额】详情；录入时，现金、微众卡可退金额需要扣除“已退款金额”的相应部分
			"已退款金额"：现金￥15.00+微众卡￥15.00+优惠券￥15.00+积分￥5.00=￥50.00
			（4）"共计"：XX.XX元
			需要根据已填写的四项金额实时计算变化；当"共计金额"与"退款录入，当前订单应退"相等时，才可以提交退款申请；否则点击提交后提示“退款金额不等于XX.XX元”
	3 母订单【实付金额】数据，需减掉退款完成的子订单退掉的相应金额（即现金+微众卡金额）
	4 订单状态为"退款中"、"退款完成"的子订单，在订单状态后给出详情图标，鼠标悬停时展示其退款详细信息；
		退款详情信息的展示方式：
		1）所有退款项的金额都不为零；如：现金￥50.00+微众卡￥20.00+优惠券￥10.00+积分￥5.00=￥85.00
		2）某种退款项金额为0时，不显示该退款方式；如：现金￥10.00+优惠券￥5.20=￥15.20
		3）只有一种退款项时，直接显示退款项及金额，如：优惠券¥ 20.00

"""

Background:
	Given 重置'weizoom_card'的bdd环境
	Given jobs登录系统
	When jobs开通使用微众卡权限
	When jobs已添加支付方式
		"""
		[{
			"type": "货到付款",
			"is_active": "启用"
		},{
			"type": "微信支付",
			"is_active": "启用"
		},{
			"type": "支付宝",
			"is_active": "启用"
		},{
			"type": "微众卡",
			"is_active": "启用"
		}]
		"""

	#创建微众卡
	Given test登录管理系统::weizoom_card
	When test新建通用卡::weizoom_card
		"""
		[{
			"name":"100元微众卡",
			"prefix_value":"200",
			"type":"virtual",
			"money":"100.00",
			"num":"5",
			"comments":"微众卡"
		}]
		"""
	#微众卡审批出库
	When test下订单::weizoom_card
		"""
		[{
			"card_info":[{
				"name":"100元微众卡",
				"order_num":"1",
				"start_date":"2016-04-07 00:00",
				"end_date":"2220-10-07 00:00"
			}],
			"order_info":{
				"order_id":"0001"
				}		
		}]
		"""
	And test批量激活订单'0001'的卡::weizoom_card

					"weizoom_card_info":
					{
						"id":"200000001",
						"password":"1234567"
					}

	When jobs已添加商品规格
		"""
		[{
			"name": "尺寸",
			"type": "文字",
			"values": [{
				"name": "M"
			}, {
				"name": "S"
			}]
		}]
		"""
	When jobs已添加商品
		"""
		[{
			"name": "商品1-1",
			"supplier": "供货商1",
			"price": 50.00,
			"stock_type": "有限",
			"stocks": 100
		},{
			"name": "商品1-2",
			"supplier": "供货商1",
			"model": {
				"models": {
					"M": {
						"price": 10.00,
						"stock_type": "有限",
						"stocks": 100
					},
					"S": {
						"price": 20,
						"stock_type": "有限"
						"stocks": 100
					}
				}
			}
		 },{
			"name": "商品2-1",
			"supplier": "供货商2",
			"price": 30.00,
			"stock_type": "有限",
			"stocks": 100
		},{
			"name": "商品2-2",
			"supplier": "供货商2",
			"price": 20.00,
			"stock_type": "有限",
			"stocks": 100
		}]
		"""

	And bill关注jobs的公众号
	Given jobs已有的会员
		"""
		[{
			"name": "bill",
			"integral":"150"
		}]
		"""
	And jobs已添加了优惠券规则
		"""
		[{
			"name": "优惠券1",
			"money": 50.00,
			"count": 2,
			"coupon_id_prefix": "coupon1_id_"
		},{
			"name": "优惠券2",
			"money": 50.00,
			"count": 1,
			"coupon_id_prefix": "coupon2_id_"
		}]
		"""
	Given jobs设定会员积分策略
		"""
		{
			"use_ceiling": 100,
			"use_condition": "on",
			"integral_each_yuan": 10
		}
		"""
	When bill访问jobs的webapp
	And bill领取jobs的优惠券
		"""
		[{
			"name": "优惠券1",
			"coupon_ids": ["coupon1_id_1"]
		}, {
			"name": "优惠券2",
			"coupon_ids": ["coupon2_id_1"]
		}]
		"""
	And bill购买jobs的商品
		"""
		{
			"order_id": "001",
			"products": [{
				"name": "商品1",
				"count": 1
			}],
			"pay_type": "微信支付",
			"date":"2015-08-08 00:00:00"
		}
		"""
	And bill购买jobs的商品
		"""
		{
			"order_id":"002",
			"products": [{
				"name": "商品1",
				"count": 1
			}],
			"coupon": "coupon1_id_1",
			"pay_type": "微信支付",
			"date":"2015-08-09 00:00:00"
		}
		"""
	And bill购买jobs的商品
		"""
		{
			"order_id":"003",
			"products": [{
				"name": "商品1",
				"count": 1
			}],
			"integral": 150,
			"integral_money":15.00,
			"pay_type": "微信支付",
			"date":"2015-08-10 00:00:00"
		}
		"""
	And bill购买jobs的商品
		"""
		{
			"order_id":"004",
			"products": [{
				"name": "商品1",
				"count": 1
			}],
			"coupon": "coupon2_id_1",
			"pay_type": "微信支付",
			"date":"2015-08-11 00:00:00"
		}
		"""