# watcher: wangli@weizoom.com, benchi@weizoom.com
# __author__ : "王丽"


Feature:用户订单导出功能-自营平台
"""
	jobs能导出用户的订单
	1.用户拆单之后显示供货商，供货商类型
"""

Background:
	#商家tom的信息
		Given 添加tom店铺名称为'tom商家'
		Given tom登录系统
		And tom已添加支付方式
			"""
			[{
				"type": "微信支付",
				"is_active": "启用"
			}]
			"""
		And tom已添加商品
			"""
			[{
				"name": "商品1",
				"purchase_price": 9.00,
				"price": 100.00
			}, {
				"name": "商品3",
				"price": 100.00,
				"weight": 2
			}, {
				"name": "商品5",
				"price": 100.00
			}]
			"""

	#自营平台jobs的信息
	Given 设置jobs为自营平台账号
	Given jobs登录系统
	And jobs已添加供货商
		"""
		[{
			"name": "丹江湖",
			"responsible_person": "陌陌",
			"supplier_tel": "13811223344",
			"supplier_address": "北京市海淀区泰兴大厦",
			"remark": ""
		}]
		"""
	And jobs设定会员积分策略
		"""
		{
			"use_ceiling": 50,
			"use_condition": "on",
			"integral_each_yuan": 1
		}
		"""
	When bill关注jobs的公众号
	Given jobs登录系统
	Given jobs已有的会员
		"""
		[{
			"name": "bill",
			"integral":"50"
		}]
		"""
	And jobs已添加支付方式
		"""
		[{
			"type": "微信支付",
			"is_active": "启用"
		}, {
			"type": "货到付款",
			"is_active": "启用"
		}]
		"""
	And jobs已添加商品
		"""
		[{
			"supplier": "丹江湖",
			"name": "商品2",
			"purchase_price": 9.00,
			"price": 100.00
		}, {
			"supplier": "丹江湖",
			"name": "商品4",
			"price": 100.00
		}]
		"""
	When jobs将商品池商品批量放入待售于'2016-04-02 10:30'
			"""
			[
				"商品1",
				"商品3",
				"商品5"
			]
			"""
	When jobs更新商品'商品1'
		"""
		{
			"supplier": "tom",
			"name": "商品1",
			"purchase_price": 9.00,
			"price": 100.00
		}
		"""
	When jobs更新商品'商品3'
		"""
		{
			"supplier": "tom",
			"name": "商品3",
			"purchase_price": 9.00,
			"price": 100.00
		}
		"""
	When jobs批量上架商品
		"""
		["商品1","商品3"]
		"""

	When jobs添加优惠券规则
		"""
		[{
			"name": "优惠券1",
			"money": 50.00,
			"count": 2,
			"start_date": "今天",
			"end_date": "1天后",
			"description":"使用说明",
			"coupon_id_prefix": "coupon1_id_"
		}]
		"""
	When bill访问jobs的webapp
	When bill领取jobs的优惠券
		"""
		[{
			"name": "优惠券1",
			"coupon_ids": ["coupon1_id_1"]
		}]
		"""
	Given jobs登录系统
	When jobs创建限时抢购活动
		"""
		{
			"name": "商品1限时抢购",
			"start_date": "今天",
			"end_date": "1天后",
			"product_name": "商品1",
			"member_grade": "全部",
			"count_per_purchase": 2,
			"promotion_price": 50.00
		}
		"""
	When jobs创建买赠活动
		"""
		[{
			"name": "商品2买一赠一",
			"start_date": "今天",
			"end_date": "1天后",
			"product_name": "商品2",
			"premium_products": [{
				"name": "商品3",
				"count": 1
			}],
			"count": 1,
			"member_grade":"全部",
			"is_enable_cycle_mode": true
		}]
		"""

@order @supplier
Scenario: 1 不同供货商订单导出
	jobs可以导出订单
	Then jobs导出订单获取订单信息
		| order_no           |  order_time |   pay_time    | product_name |  model | product_unit_price | count | sales_money | weight | methods_of_payment | money_total | money | money_wcard | postage | integral | coupon_money | coupon_name |  status   | member | ship_name |  ship_tele  | ship_province |        ship_address           | shipper | leader_remark | sources | supplier_type | logistics |   number  | delivery_time | remark | customer_message | customer_source | customer_recommender | is_qr_code | is_older_mermber | purchase_price | purchase_costs |
		| 0000009-100        |  2016-02-01 |               |    商品3     |        |        100.00      |   1   |    100.00   |   2    |      微信支付      |     0.00    |  0.00 |             |  0.00   |          |              |             |  待支付   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000009-100        |             |               |    商品5     |        |        100.00      |   1   |    100.00   |        |      微信支付      |             |       |             |  0.00   |          |              |             |  待支付   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000008-丹江湖-100 |  2016-02-02 |               |    商品4     |        |        100.00      |   1   |    100.00   |        |      微信支付      |     0.00    |  0.00 |             |  0.00   |          |              |             |  待支付   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000008-tom商家-100|             |               |    商品5     |        |        100.00      |   1   |    100.00   |        |      微信支付      |             |       |             |  0.00   |          |              |             |  待支付   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000007-丹江湖     |  2016-02-03 |  2016-02-03   |    商品4     |        |        100.00      |   1   |    100.00   |        |      货到付款      |    200.00   | 200.00|     0.00    |  0.00   |    0.00  |              |             |  已发货   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000007-tom商家    |             |               |    商品5     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  待发货   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000006            |  2016-02-04 |               |    商品3     |        |        100.00      |   1   |    100.00   |   2    |      货到付款      |    200.00   | 200.00|     0.00    |  0.00   |    0.00  |              |             |  待发货   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000006            |             |               |    商品5     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  待发货   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000005            |  2016-02-05 |  2016-02-05   |    商品3     |        |        100.00      |   1   |    100.00   |   2    |      货到付款      |    200.00   | 200.00|     0.00    |  0.00   |    0.00  |              |             |  已发货   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000005            |             |               |    商品5     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  已发货   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000004-丹江湖     |  2016-02-06 |  2016-02-07   |    商品4     |        |        100.00      |   1   |    100.00   |        |      货到付款      |    200.00   | 200.00|     0.00    |  0.00   |    0.00  |              |             |  已完成   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000004-tom商家    |             |               |    商品5     |        |        100.00      |   1   |    100.00   |   2    |      货到付款      |             |       |             |  0.00   |          |              |             |  已完成   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000003            |  2016-02-08 |  2016-02-09   |    商品3     |        |        100.00      |   1   |    100.00   |        |      货到付款      |    200.00   | 200.00|     0.00    |  0.00   |    0.00  |              |             |  已完成   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000003            |             |               |    商品5     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  已完成   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000002-tom商家    |  2016-02-09 |      今天     |    商品1     |        |        50.00       |   1   |    50.00    |        |      微信支付      |    200.00   | 200.00|     0.00    |  0.00   |   50.00  |              |             |  退款中   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |      9.0       |      9.0       |
		| 0000002-丹江湖     |             |               |    商品2     |        |        100.00      |   1   |    100.00   |        |      微信支付      |             |       |             |  0.00   |          |              |             |  退款中   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |      9.0       |      9.0       |
		| 0000002-丹江湖     |             |               | (赠品)商品3  |        |        100.00      |   1   |    100.00   |   1    |      微信支付      |             |       |             |  0.00   |          |              |             |  退款中   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000002-tom商家    |             |               |    商品3     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  退款中   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000001-tom商家    |     今天    |      今天     |    商品1     |        |        50.00       |   1   |    50.00    |        |      货到付款      |     0.00    |  0.00 |     0.00    |  0.00   |    0.00  |              |             |  已取消   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |      9.0       |      9.0       |
		| 0000001-丹江湖     |     今天    |               |    商品2     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  已取消   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |      9.0       |      9.0       |
		| 0000001-丹江湖     |     今天    |               | (赠品)商品3  |        |        100.00      |   1   |    100.00   |   1    |      货到付款      |             |       |             |  0.00   |          |              |             |  已取消   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | 丹江湖  |   自建供货商  | 顺丰速运  | 123456789 |  2016-03-01   |        |                  |    直接关注     |                      |            |                  |                |                |
		| 0000001-tom商家    |     今天    |               |    商品3     |        |        100.00      |   1   |    100.00   |        |      货到付款      |             |       |             |  0.00   |          |              |             |  已取消   |  bill  |  未知姓名 | 11111111111 |    北京市     | 北京市 北京市 海淀区 长安大街 |         |               | tom商家 |   同步供货商  |           |           |               |        |                  |    直接关注     |                      |            |                  |                |                |
	Thenjobs导出订单获取订单统计信息
		"""  
		[{  
			 "订单量":9, 
			"已完成":2, 

			"商品金额":1900.00,
			"支付总额":1200.00,
			"现金支付金额":1200.00,
			"微众卡支付金额":0.00,

			"赠品总数":1,
			"积分抵扣总金额":50.00,
			"优惠劵价值总额":0.00
		}]
		"""


