#_author_:王丽
#_edit_:benchi
#_edit_:新新

Feature:自定义模块——【基础模块】标题-页面
        显示位置：居左、居中、居右，
        根据字数不同，副标题与时间的显示位置也不同

Background:
	Given jobs登录系统
	And jobs已添加模块
		"""
		[	
			{"modle_name": "富文本"},
			{"modle_name": "商品"},
			{"modle_name": "商品列表"},
			{"modle_name": "图片广告"},
			{"modle_name": "公告"},
			{"modle_name": "标题"},
			{"modle_name": "文本导航"},
			{"modle_name": "图片导航"},
			{"modle_name": "辅助空白"},
			{"modle_name": "橱窗"}
		]
		"""

Scenario:(1)标题模块,编辑、删除、字数和控制校验

	When jobs设置标题'小于30''不折行'和副标题'小于30''不折行'、显示位置'默认'、背景色'默认'
	"""
	[{
		"title":"标题字数小于30不折行",
		"subtitle":"副标题字数小于30+日期不折行",
		"time":"2015-5-13 10:13"

	}]
	"""
	Then jobs展示区第一行'居左'显示'标题'，第二行'居左'显示'副标题+日期'
	And jobs展示区背景色'无色'


	#编辑标题模块
		when jobs修改设置标题'小于30''折行'和副标题'小于30''折行'、显示位置'居中'、背景色'黄色'
		"""
		[{
			"title":"标题字数小于30折行",
			"subtitle":"副标题字数小于30折行",
			"time":"2015-5-13 10:13",
			"display_position":"居中",
			"background_color":"yellow"

		}]
		"""
		Then jobs展示区第一二行'折行''居中'显示'标题'，第三四行'折行''居中'显示'副标题'
		And  jobs展示区背景色'黄色'

		When jobs修改设置标题'小于30''不折行'和副标题'小于30''不折行'、显示位置'居右'、背景色'蓝色'
		"""
		[{
			"title":"标题字数小于30不折行",
			"subtitle":"副标题字数小于30加日期后折行",
			"time":"2015-5-13 10:13",
			"display_position":"居右",
			"background_color":"blue"

		}]
		"""
		Then jobs展示区第一行'居右'显示'标题',第二行'居右'显示'副标题,第三行'居右'显示'日期'
		And  jobs展示区标背景色'蓝色'

		When jobs修改设置标题'小于30''不折行'、显示位置'默认'、背景色'默认'
		"""
		[{
			"title":"标题字数小于30不折行"

		}]
		"""
		Then jobs展示区第一行'居左'显示'标题'
		And  jobs展示区背景色'无色'

		When jobs修改设置标题'小于30''不折行'、副标题'小于30''不折行'、显示位置'默认'、背景色'默认'
		"""
		[{
			"title":"标题字数小于30不折行",
			"subtitle":"副标题字数小于30不折行",

		}]
		"""
		Then jobs展示区第一行'居左'显示'标题',第二行'居左'显示'副标题'
		And  jobs展示区背景色'无色'

	#标题模块，字数校验
		When jobs设置标题'大于30''折行'、副标题'大于30''折行'、显示位置'默认'、背景色'默认'
		"""
		[{
			"title":"标题字数大于30",
			"subtitle":"副标题字数大于30"

		}]
		"""
		Then jobs展示区第一二行'居左''折行'显示'标题'，第三四行'居左''折行'显示'副标题'
		And  jobs展示区背景色'无色'
		And  jobs编辑区提示错误信息'标题名不能超过30字'
		And  jobs编辑区提示错误信息'副标题名不能超过30字'

	#删除标题模块,弹出确认删除提示窗体
		When job删除标题模块
		Then jobs展示区当前标题模块删除，编辑焦点消失
		And  jobs编辑区对应的编辑窗体关闭