# _author_: "新新"

Feature: 商品排序及分页
	Jobs能通过排序管理商品,已上架的商品
	1.商品没有排序时,默认排序显示0,按创建时间的倒序显示
	2.设置排序为1时,在手机端置顶
	3.商品列表与手机端商品列表排序展示不同
	4.修改排序重复时,更新为最后排序的商品,被重复的商品显示0
	5.初始化排序分页,分页时修改不是当前页的排序,刷新页面后,更新排序
	6.分页时,修改不是当前页的排序,重复排序时,更新为最后排序的商品,刷新页面后,更新排序
Background:
	Given jobs登录系统
	And jobs已添加商品
		"""
		[{
			"name":"商品1",
			"time":"2015-06-01 08:00:00",
			"sort":"",
			"status":"上架"
		},{
			"name":"商品2",
			"time":"2015-07-01 08:00:00",
			"sort":"",
			"status":"上架"
		},{
			"name":"商品3",
			"time":"2015-08-01 08:00:00",
			"sort":"",
			"status":"上架"
		}]	
		"""
	And bill关注jobs的公众号

@mall2 @jz
Scenario: 1商品排序初始化
	Jobs商品没有排序时,按创建时间的倒序显示
	Given jobs登录系统
	Then jobs能获取商品列表
		| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品2   | 2015-07-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When bill访问jobs的webapp
	Then bill能获取商品列表
		| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品2   | 2015-07-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |

Scenario: 2修改商品排序
	Jobs从初始化编辑商品排序
	Then jobs能获取商品列表 
		| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品2   | 2015-07-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When jobs修改了商品2的排序为"1"
	Then jobs能获取商品列表
		| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  1   |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When bill访问jobs的webapp
	###设置排序为1时,在手机端置顶
	Then bill能获取商品列表
		| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  1   |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When jobs修改了商品1的排序为"2"
	Then jobs能获取商品列表
	###有排序时,按排序的倒序显示
		| name    | time                | sort |
		| 商品1   | 2015-06-01 08:00:00 |  2   |
		| 商品2   | 2015-07-01 08:00:00 |  1   |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
	When bill访问jobs的webapp
	###商品列表与手机端商品列表排序展示不同
	Then bill能获取商品列表
		| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  1   |
		| 商品1   | 2015-06-01 08:00:00 |  2   |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
	###修改排序重复时,更新为最后排序的商品,被重复的商品显示0
	When jobs修改了商品2的排序为"2"
	And Jobs弹出提示框"位置2已存在,是否替换?"
	And Jobs点击"确定"
	Then jobs能获取商品列表 
		| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  2   |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When bill访问jobs的webapp
	Then bill能获取商品列表
		| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  2   |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |


Scenario:3分页
    #没有排序时,按照创建时间倒序排列
    #初始化分页
	Then jobs能获取商品列表 
		| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
		| 商品2   | 2015-07-01 08:00:00 |  0   |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When jobs已设置分页条件
		"""
		{
			"page_count":1
		}
		"""
    Then jobs能获取商品列表
    	| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
	And jobs获取显示共3页
	When jobs浏览'下一页'
	Then jobs能获取商品列表
		| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  0   |

	When jobs浏览'第3页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When jobs浏览'上一页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  0   |
##修改不是当前页的排序,刷新后按照排序显示列表
	When jobs修改了商品2的排序为"2"
	And jobs浏览'第1页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  2   |
###修改不是当前页重复的排序,更新为最后设置排序的商品
	When jobs浏览'下一页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  0   |
	When jobs修改了商品3的排序为"2"
	And Jobs弹出提示框"位置2已存在,是否替换?"
	And Jobs点击"确定"
	When jobs浏览'上一页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  2   |
	When jobs浏览'下一页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  0   |
	When jobs浏览'第3页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品1   | 2015-06-01 08:00:00 |  0   |
	When jobs修改了商品1的排序为"5"
	And Jobs浏览'第1页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品1   | 2015-06-01 08:00:00 |  5   |
	When jobs浏览'下一页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品3   | 2015-08-01 08:00:00 |  2   |
	When jobs浏览'第3页'
	Then jobs能获取商品列表
	 	| name    | time                | sort |
		| 商品2   | 2015-07-01 08:00:00 |  0   |





