#_author_ "师帅"
Feature: 店铺导航
#没有启用时，在手机端不显示，启用后才会在手机端显示
#启用自定义菜单样式
#1.勾选'店铺主页'，'微页面'，'个人中心'，保存后，会在手机端显示，不勾选就不会显示
#2.一级菜单进来后，默认有一个，最多添加3个，字数限制为5个字，超过不能输入
#3.二级菜单最多添加5个，字数限制为10个字，超过不能输入
#4.手机端左下角的小房子，点击进入店铺主页
#5.标题和链接可以为空，不验证
#6.一级菜单标题为空时，在手机端显示'标题名'，二级菜单标题为空时，在手机端显示空行
#7.一级菜单配置链接后，添加二级菜单，链接消失，删除二级菜单后，链接为原来配置的链接
#8.配置链接后，点击跳转，二级菜单标题为空，配置链接，点击跳转链接相应的页面
#9.在右侧进行相应配置时，左侧手机会实时显示
#启用APP导航模式
#1.勾选'店铺主页'，'微页面'，'个人中心'，保存后，会在手机端显示，不勾选就不会显示
#2.一级菜单进来后，默认有一个，添加个数不限制，字数限制为10个字，超过不能输入
#3.二级菜单添加个数不限制，字数限制为10个字，超过不能输入
#4.标题和链接可以为空，不验证
#5.一级菜单标题为空时，在手机端显示'标题名'，二级菜单标题为空时，在手机端显示空行
#6.一级菜单配置链接后，添加二级菜单，链接消失，删除二级菜单后，链接为原来配置的链接
#7.配置链接后，点击跳转，二级菜单标题为空，配置链接，点击跳转链接相应的页面
#8.在右侧进行相应配置时，左侧手机会实时显示
#9.左侧手机端，点击'全部商品'，进入默认商品列表页
#10.左侧手机端，点击'首页'，进入店铺主页，点击'我的'，进入个人中心
#11.在APP导航模式中配置的只在分类中有效
#12.关注过的用户分享给未关注的用户，未关注的用户点击'我的'，弹出关注二维码（若在页面中配置个人中心，则点击后，跳转至个人中心，不显示二维码）
#13.店铺导航模式在店铺装修中仅适用微页面和店铺主页，不适用个性模板
